# Pandas

In computer programming, pandas is a software library written for the Python programming language for data manipulation and analysis.Pandas DataFrame is two-dimensional heterogeneous tabular data structure with labeled axes (rows and columns). Pandas DataFrame consists of three principal components, the data, rows, and columns.

In [22]:
import pandas as pd
import numpy as np

In [4]:
data = [10,100,1000]
df = pd.DataFrame(data)
df

      0
0    10
1   100
2  1000

### Creating DataFrame from dictionary

In [5]:
data = {'Name':["Hamza","Ali","Asif"],
       'Age':[21,49,43]}
df = pd.DataFrame(data)
df

    Name  Age
0  Hamza   21
1    Ali   49
2   Asif   43

### Reading a CSV file

In [17]:
df = pd.read_csv(r'C:\Users\hamza\Desktop\Udemy Course\Tensorflow 2.0\Pandas Datasets\nba.csv',index_col = "Name")

In [18]:
type(df)

pandas.core.frame.DataFrame

### Missing values

In [26]:
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
df = pd.DataFrame(dict)
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [27]:
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [31]:
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [32]:
df.dropna()

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

In [34]:
df.shape

(4, 3)